lib/tasks/import.rake

    task :movies_and_reviews => :environment do
      require 'csv'

      # Import movies
      CSV.foreach('movies.csv', headers: true) do |row|
        Movie.create(title: row['Movie'], description: row['Description'], year: row['Year'], director: row['Director'], filming_location: row['Filming location'], country: row['Country'])
      end

      # Import reviews
      CSV.foreach('reviews.csv', headers: true) do |row|
        movie = Movie.find_by(title: row['Movie'])
        Review.create(movie: movie, user: row['User'], stars: row['Stars'], review: row['Review'])
---
INSERT INTO "movies" ("title", "description", "year", "director", "filming_location", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT ?  [["title", "Gone in 60 seconds"], ["LIMIT", 1]]
INSERT INTO "reviews" ("movie_id", "user", "stars", "review", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["movie_id", 1], ["user", "Sam Pedro"], ["stars", 4], ["review", "Really good!"], ["created_at", "2024-02-03 11:37:03.644522"], ["updated_at", "2024-02-03 11:37:03.644522"]]