app/controllers/movies_controller.rb

    def index
      @movies = Movie.includes(:reviews)
                     .group(:id)
                     .order(average_rating: :desc)
---
SELECT "movies".* FROM "movies" GROUP BY "movies"."id" ORDER BY "average_rating" DESC
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)